Repository: devaliuz/Ki-Ra
Catalog: Ki-Ra/src/Language/texts.*.resx
Languages: de

# INFO_Initial_Greeting_TXT
source: Welcome! The app is starting. Please be patient for a moment.
de: Willkommen! Die App wird gestartet. Bitte haben Sie einen Moment Geduld.

# ERROR_Modeldirectory_not_found
source: The model directory was not found:
de: Das Modellverzeichnis wurde nicht gefunden:

# INFO_Automatically_chosen_Model
source: Automatically selected model:
de: Automatisch gewähltes Modell:

# INPUT_Chose_Model
source: Which model should be loaded?
de: Welches Model soll geladen werden?

# INPUT_Chose_Model_Range
source: Please select a model (1-
de: Bitte wählen Sie ein Modell (1-

# INFO_chosen_Model
source: Selected model:
de: Gewähltes Modell:

# INFO_Initial_Greeting_VOICE
source: Hello, I'm Kira, your personal AI assistant. I'm loading my databases and will be available shortly. Please be patient for a moment.
de: Hallo ich bin Kira, dein persönlicher KI-Assistent. Ich lade meine Datenbanken und stehe dir gleich zur Verfügung. Bitte hab einen Moment Geduld.

# INFO_Loading_Model
source: Loading model...
de: Lade Modell...

# INFO_Loading_Recognizer
source: Creating recognizer...
de: Erstelle Recognizer...

# INFO_Model_loaded
source: Model successfully loaded.
de: Modell erfolgreich geladen.

# INFO_Recognizer_loaded
source: Recognizer successfully created.
de: Recognizer erfolgreich erstellt.

# INFO_Init_Recognitionservice
source: Initializing VoiceRecognitionService...
de: Initialisiere VoiceRecognitionService...

# INFO_Init_Recognitionservice_done
source: VoiceRecognitionService initialized.
de: VoiceRecognitionService initialisiert.

# INFO_Ready_VOICE
source: The app is now ready.
de: Die App ist jetzt bereit.

# ERROR_occured
source: An error has occurred:
de: Ein Fehler ist aufgetreten:

# ERROR_Message
source: Message:
de: Nachricht:

# INFO_Waiting_for_Trigger
source: Waiting for trigger word 'Kira'...
de: Warte auf Triggerwort 'Kira'...

# INFO_Triggered
source: Trigger word recognized. Listening for command...
de: Triggerwort erkannt. Höre auf Befehl...

# INFO_Convert_Audio
source: Processing audio...
de: Verarbeite Audio...

# INFO_Recognized_Order
source: Understood command:
de: Verstandener Befehl:

source: Answer:
de: Antwort:

# INFO_No_Voirce_Recognized
source: No voice input recognized.
de: Keine Spracheingabe erkannt.

# INFO_Didnt_Understand
source: Sorry, I didn't understand that.
de: Entschuldigung, ich habe das nicht verstanden.

# MANAGE_Commands
source: Do you want to add new commands or answers, or delete existing commands?
de: Möchtest du neue Befehle oder Antworten hinzufügen, oder vorhandene Befehle löschen?

# MANAGE_Didnt_Understand
source: I didn't understand you. Please say 'Add' or 'Delete'.
de: Ich habe dich nicht verstanden. Bitte sage 'Hinzufügen' oder 'Löschen'.

# MANAGE_Ask_For_Answer
source: Please say 'Add' or 'Delete'.
de: Bitte sage 'Hinzufügen' oder 'Löschen'.

# GENERAL_Add
source: Add
de: Hinzufügen

# GENERAL_Delete
source: Delete
de: Löschen

# COMMAND_Help
source: I have internalized the following commands:
de: Ich habe folgende Befehle verinnerlicht:

# MANAGE_New_Command
source: Okay, let's add a new command.
de: Okay, lassen Sie uns einen neuen Befehl hinzufügen.

# MANAGE_Waiting_for_new_Command
source: Please say the name of the new command.
de: Bitte sagen Sie den Namen des neuen Befehls.

# MANAGE_Comand_Exists
source: This command already exists. We're adding a new answer.
de: Dieser Befehl existiert bereits. Wir fügen eine neue Antwort hinzu.

# MANAGE_Add_Answer
source: Please say the answer for this command.
de: Bitte sagen Sie die Antwort für diesen Befehl.

# MANAGE_Adding_New_Command
source: New command is being created.
de: Neuer Befehl wird angelegt.

# MANAGE_Check_Answer
source: The new answer is: $$$. Is that correct? Say yes to confirm.
de: Die neue Antwort lautet: $$$. Ist das korrekt? Sagen Sie ja, um zu bestätigen.

# MANAGE_Commit_new_Answer
source: Please confirm with 'yes' or 'no'.
de: Bitte bestätigen Sie mit 'ja' oder 'nein'.

# MANAGE_Succsess
source: New command was successfully added.
de: Neuer Befehl wurde erfolgreich hinzugefügt.

# MANAGE_Cancel
source: Operation cancelled. The new command was not added.
de: Vorgang abgebrochen. Der neue Befehl wurde nicht hinzugefügt.

# MANAGE_Delete_Command_Input
source: Which command do you want to delete?
de: Welchen Befehl möchtest du löschen?

# MANAGE_Delete_Command_CTA
source: Please name the command.
de: Bitte nenne den Befehl.

# MANAGE_Delete_Succsess
source: The command '$$$' was successfully deleted.
de: Der Befehl '$$$' wurde erfolgreich gelöscht.

# MANAGE_Delete_Cancel
source: The command '$$$' does not exist.
de: Der Befehl '$$$' existiert nicht.

# ERROR_LangModel_Directory_not_found
source: The language model directory was not found:
de: Das Sprachmodell-Verzeichnis wurde nicht gefunden:

# INFO_UI_Language
source: User interface set to English.
de: Userinterface auf deutsch gesetzt.

# COMMAND_hallo
source: hello
de: hallo

# COMMAND_SYN_hallo_gruessgott
source: greetings
de: grüß gott

# COMMAND_SYN_hallo_gutentag
source: good day
de: guten tag

# COMMAND_SYN_hallo_servus
source: howdy
de: servus

# COMMAND_SYN_hallo_moin
source: morning
de: moin

# COMMAND_SYN_hallo_gruezi
source: g'day
de: grüezi

# COMMAND_SYN_hallo_sali
source: hiya
de: sali

# COMMAND_ANSW_hallo_1
source: Good day! What can I do for you?
de: Guten Tag! Was kann ich für Sie tun?

# COMMAND_ANSW_hallo_2
source: Hi! How can I assist you?
de: Hi! Wie kann ich Ihnen behilflich sein?

# COMMAND_ANSW_hallo_3
source: Greetings! Nice to hear from you.
de: Grüß Gott! Freut mich, Sie zu hören.

# COMMAND_ANSW_hallo_4
source: Howdy! What brings you here?
de: Servus! Was führt Sie zu mir?

# COMMAND_ANSW_hallo_5
source: Morning! Nice to see you.
de: Moin! Schön, dass Sie da sind.

# COMMAND_ANSW_hallo_6
source: Hello! How can I help you?
de: Hallo! Wie kann ich Ihnen helfen?

# COMMAND_ANSW_hallo_7
source: Cheers, you little rascal.
de: Cheers du kleiner Sack.

# COMMAND_wie_geht_es_dir
source: how are you
de: wie geht es dir

# COMMAND_SYN_wie_geht_es_dir_wiegehts
source: how's it going
de: wie geht's

# COMMAND_SYN_wie_geht_es_dir_allesklar
source: everything alright
de: alles klar

# COMMAND_SYN_wie_geht_es_dir_wielaeufts
source: how's it hanging
de: wie läuft's

# COMMAND_SYN_wie_geht_es_dir_wiefuehlstdu
source: how do you feel
de: wie fühlst du dich

# COMMAND_SYN_wie_geht_es_dir_stimmung
source: what's your mood
de: wie ist deine stimmung

# COMMAND_SYN_wie_geht_es_dir_gutdrauf
source: are you in good spirits
de: bist du gut drauf

# COMMAND_SYN_wie_geht_es_dir_allesgut
source: all good with you
de: alles gut bei dir

# COMMAND_ANSW_wie_geht_es_dir_1
source: I'm doing great, thank you!
de: Mir geht es hervorragend, vielen Dank!

# COMMAND_ANSW_wie_geht_es_dir_2
source: I'm in a great mood, and you?
de: Ich bin bestens gelaunt, und selbst?

# COMMAND_ANSW_wie_geht_es_dir_3
source: I feel fantastic, thanks for asking.
de: Ich fühle mich großartig, danke der Nachfrage.

# COMMAND_ANSW_wie_geht_es_dir_4
source: Everything's great with me, how about you?
de: Alles bestens bei mir, wie sieht's bei Ihnen aus?

# COMMAND_ANSW_wie_geht_es_dir_5
source: I'm in top form, and you?
de: Ich bin in Topform, und Sie?

# COMMAND_ANSW_wie_geht_es_dir_6
source: I'm doing well, thanks for asking!
de: Mir geht es gut, danke der Nachfrage!

# COMMAND_ANSW_wie_geht_es_dir_7
source: Excellent, and how about you?
de: Ausgezeichnet, und Ihnen?

# COMMAND_erzaehle_einen_witz
source: tell a joke
de: erzähle einen witz

# COMMAND_SYN_erzaehle_einen_witz_erzaehl
source: tell me a joke
de: erzähl einen witz

# COMMAND_SYN_erzaehle_einen_witz_witz
source: joke
de: witz

# COMMAND_SYN_erzaehle_einen_witz_witze
source: jokes
de: witze

# COMMAND_SYN_erzaehle_einen_witz_scherz
source: jest
de: scherz

# COMMAND_SYN_erzaehle_einen_witz_etwas_lustiges
source: something funny
de: etwas lustiges

# COMMAND_SYN_erzaehle_einen_witz_zum_lachen
source: to laugh
de: zum lachen

# COMMAND_SYN_erzaehle_einen_witz_sei_lustig
source: be funny
de: sei lustig

# COMMAND_SYN_erzaehle_einen_witz_mach_einen_witz
source: make a joke
de: mach einen witz

# COMMAND_SYN_erzaehle_einen_witz_bring_mich_zum_lachen
source: make me laugh
de: bringen sie mich zum lachen

# COMMAND_SYN_erzaehle_einen_witz_sei_witzig
source: be humorous
de: sei witzig

# COMMAND_SYN_erzaehle_einen_witz_erzaehle_etwas_komisches
source: tell me something funny
de: erzähle etwas komisches

# COMMAND_ANSW_erzaehle_einen_witz_1
source: What's orange and sounds like a parrot? A carrot!
de: Was ist orange und klingt wie ein Papagei? Eine Karotte!

# COMMAND_ANSW_erzaehle_einen_witz_2
source: Why can't ghosts lie? Because you can see right through them.
de: Warum können Geister nicht lügen? Weil man sie durchschaut.

# COMMAND_ANSW_erzaehle_einen_witz_3
source: What does a pirate say at a computer? Shiver me timbers!
de: Was sagt ein Pirat am Computer? Shiver me timbers!

# COMMAND_ANSW_erzaehle_einen_witz_4
source: What's a tree's favorite drink? Root beer.
de: Was ist das Lieblingsgetränk eines Baumes? Wurzelbier.

# COMMAND_ANSW_erzaehle_einen_witz_5
source: What's green and hops through the woods? A frog in pajamas.
de: Was ist grün und hüpft durch den Wald? Ein Frosch im Schlafanzug.

# COMMAND_ANSW_erzaehle_einen_witz_6
source: Why do bees wear helmets? Because they might dissolve into thin air.
de: Warum tragen Bienen Helme? Weil sie sich in Luft auflösen.

# COMMAND_ANSW_erzaehle_einen_witz_7
source: What's black and white and sits on a tree? A hungry panda.
de: Was ist schwarz-weiß und sitzt auf einem Baum? Ein hungriger Panda.

# COMMAND_ANSW_erzaehle_einen_witz_8
source: What does a mathematician say to his friend? I'm so happy, I could say Pi-times-thumb!
de: Was sagt ein Mathematiker zu seinem Freund? Ich bin so glücklich, dass ich Pi mal Daumen sagen kann.

# COMMAND_ANSW_erzaehle_einen_witz_9
source: Why can't fish play basketball? Because they're afraid of the net.
de: Warum können Fische nicht Basketball spielen? Weil sie Angst vor dem Netz haben.

# COMMAND_ANSW_erzaehle_einen_witz_10
source: What's the opposite of a hot dog? A cold cat.
de: Was ist das Gegenteil von einem Hotdog? Ein kalter Kater.

# COMMAND_ANSW_erzaehle_einen_witz_11
source: What's an astronaut's favorite food? UFOs (Unidentified Fried Objects).
de: Was ist das Lieblingsessen eines Astronauten? Ufos.

# COMMAND_ANSW_erzaehle_einen_witz_12
source: What's the difference between a piano and a fish? You can tune a piano, but you can't tuna fish!
de: Was ist der Unterschied zwischen einem Klavier und einem Fisch? Man kann ein Klavier stimmen, aber man kann einen Fisch nicht klavieren.

# COMMAND_ANSW_erzaehle_einen_witz_13
source: Why don't giraffes wear socks? Because they have long necks.
de: Warum tragen Giraffen keine Socken? Weil sie lange Hälse haben.

# COMMAND_ANSW_erzaehle_einen_witz_14
source: What's a snowman's favorite food? Ice-cicles.
de: Was ist das Lieblingsessen eines Schneemanns? Eiszapfen.

# COMMAND_ANSW_erzaehle_einen_witz_15
source: Why don't ants go to church? Because they're in-sects.
de: Warum gehen Ameisen nicht in die Kirche? Weil sie Insekten sind.

# COMMAND_ANSW_erzaehle_einen_witz_16
source: What's a computer's favorite snack? Microchips.
de: Was ist das Lieblingsessen eines Computers? Chips.

# COMMAND_ANSW_erzaehle_einen_witz_17
source: What's a programmer's favorite drink? Java.
de: Was ist das Lieblingsgetränk eines Programmierers? Java.

# COMMAND_ANSW_erzaehle_einen_witz_18
source: Why are tomatoes so red? Because they're embarrassed that they can't swim.
de: Warum sind Tomaten so rot? Weil sie sich schämen, dass sie nicht schwimmen können.

# COMMAND_ANSW_erzaehle_einen_witz_19
source: What's a ghost's favorite food? Boo-sghetti.
de: Was ist das Lieblingsessen eines Geistes? Buh-Spaghetti.

# COMMAND_ANSW_erzaehle_einen_witz_20
source: Why don't birds wear shoes? Because they already have feathers.
de: Warum tragen Vögel keine Schuhe? Weil sie schon Federn haben.

# COMMAND_auf_wiedersehen
source: goodbye
de: auf wiedersehen

# COMMAND_SYN_auf_wiedersehen_tschuess
source: bye
de: tschüss

# COMMAND_SYN_auf_wiedersehen_bis_bald
source: see you soon
de: bis bald

# COMMAND_SYN_auf_wiedersehen_machs_gut
source: take care
de: mach's gut

# COMMAND_SYN_auf_wiedersehen_bis_dann
source: see you later
de: bis dann

# COMMAND_SYN_auf_wiedersehen_leb_wohl
source: farewell
de: leb wohl

# COMMAND_SYN_auf_wiedersehen_auf_wiederhoeren
source: talk to you later
de: auf wiederhören

# COMMAND_SYN_auf_wiedersehen_bis_zum_naechsten_mal
source: until next time
de: bis zum nächsten mal

# COMMAND_SYN_auf_wiedersehen_schoenen_tag_noch
source: have a nice day
de: schönen tag noch

# COMMAND_ANSW_auf_wiedersehen_1
source: Take care! See you soon.
de: Machen Sie es gut! Bis bald.

# COMMAND_ANSW_auf_wiedersehen_2
source: Take care of yourself! We'll see each other again.
de: Passen Sie auf sich auf! Wir sehen uns.

# COMMAND_ANSW_auf_wiedersehen_3
source: All the best! Hope to see you soon.
de: Alles Gute! Hoffentlich bis bald.

# COMMAND_ANSW_auf_wiedersehen_4
source: Have a nice day! Until next time.
de: Einen schönen Tag noch! Bis zum nächsten Mal.

# COMMAND_ANSW_auf_wiedersehen_5
source: Stay healthy! Looking forward to our next meeting.
de: Bleiben Sie gesund! Auf ein baldiges Wiedersehen.

# COMMAND_ANSW_auf_wiedersehen_6
source: Goodbye! I hope we'll talk again soon.
de: Auf Wiedersehen! Ich hoffe, wir sprechen bald wieder.

# COMMAND_ANSW_auf_wiedersehen_7
source: Bye! See you next time.
de: Tschüss! Bis zum nächsten Mal.

# COMMAND_befehle_verwalten
source: manage commands
de: befehle verwalten

# COMMAND_SYN_befehle_verwalten_hinzufuegen
source: add command
de: befehl hinzufügen

# COMMAND_SYN_befehle_verwalten_loeschen
source: delete command
de: befehl löschen

# COMMAND_SYN_befehle_verwalten_aendern
source: change command
de: befehl ändern

# COMMAND_SYN_befehle_verwalten_kommandos
source: manage commands
de: kommandos verwalten

# COMMAND_SYN_befehle_verwalten_kommando_hinzufuegen
source: add command
de: kommando hinzufügen

# COMMAND_SYN_befehle_verwalten_kommando_loeschen
source: delete command
de: kommando löschen

# COMMAND_SYN_befehle_verwalten_kommando_aendern
source: change command
de: kommando ändern

# COMMAND_SYN_befehle_verwalten_verwaltung
source: management
de: verwaltung

# COMMAND_was_kannst_du
source: what can you do
de: was kannst du

# COMMAND_SYN_was_kannst_du_hilfe
source: help
de: hilfe

# COMMAND_SYN_was_kannst_du_funktionen
source: functions
de: funktionen

# COMMAND_SYN_was_kannst_du_faehigkeiten
source: abilities
de: fähigkeiten

# COMMAND_SYN_was_kannst_du_deinefunktionen
source: what are your functions
de: was sind deine funktionen

# COMMAND_SYN_was_kannst_du_zeigefaehigkeiten
source: show me your abilities
de: zeige mir deine fähigkeiten

# COMMAND_SYN_was_kannst_du_wasmachstdu
source: what do you do
de: was machst du

# COMMAND_SYN_was_kannst_du_wiehelfen
source: how can you help me
de: wie kannst du mir helfen
